{"pages":[{"title":"[404]","text":"","link":"/404.html"},{"title":"About Me","text":"XiXian","link":"/about/index.html"}],"posts":[{"title":"My First Post","text":"Look at my AniList. Awesome.","link":"/First-Post/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment PermalinksYou can specify the permalinks for your site in _config.yml or in the front-matter for each post. VariablesBesides the following variables, you can use any attributes in the permalink. Variable Description :year Published year of posts (4-digit) :month Published month of posts (2-digit) :i_month Published month of posts (Without leading zeros) :day Published day of posts (2-digit) :i_day Published day of posts (Without leading zeros) :title Filename :post_title Post title :id Post ID :category Categories. If the post is uncategorized, it will use the default_category value. You can define the default value of each variable in the permalink through the permalink_defaults setting: 12permalink_defaults: lang: en Examples Given a post named hello-world.md in the source/_posts folder with the following content. 12345title: Hello Worlddate: 2013-07-14 17:01:34categories:- foo- bar Setting Result :year/:month/:day/:title/ 2013/07/14/hello-world :year-:month-:day-:title.html 2013-07-14-hello-world.html :category/:title foo/bar/hello-world Multi-language Support To create a multi-language site, you can modify the new_post_name and permalink settings like this: 12new_post_name: :lang/:title.mdpermalink: :lang/:title/ When you create a new post, the post will be saved to: 12$ hexo new \"Hello World\" --lang tw# =&gt; source/_posts/tw/Hello-World.md and the URL will be: 1http://localhost:4000/tw/hello-world/ More info: Deployment","link":"/hello-world/"}],"tags":[],"categories":[]}